import time

print('UTC time: ' + time.strftime('%Y/%m/%d %H:%M:%S', time.gmtime()))       # UTC time: 2022/01/17 08:49:39
print('Local time: ' + time.strftime('%Y/%m/%d %H:%M:%S', time.localtime()))  # Local time: 2022/01/17 09:49:39

# Зміщення місцевого часового поясу за літнім часом у секундах на захід від UTC, якщо він визначений. Це негативно, якщо
# місцевий часовий пояс літнього часу розташований на схід від UTC (як у Західній Європі, включаючи Великобританію).
# Використовуйте це лише якщо daylight значення відмінне від нуля. Дивіться примітку нижче.
print(time.altzone)  # -7200
print(time.altzone/60/60)  # -2.0

# time.daylight Ненульовий, якщо визначено часовий пояс для літнього часу. Дивіться примітку нижче.
print(time.daylight)  # 1

#  time.timezone Зміщення місцевого (не літнього часу) часового поясу в секундах на захід від UTC
#  (від’ємне значення в більшості країн Західної Європи, позитивне значення в США, нульове значення у Великобританії).
#  Дивіться примітку нижче.
print(time.timezone)  # -3600
print(time.timezone/60/60)  # -1.0

# time.tzname Кортеж із двох рядків: перший – це ім’я локального часового поясу, який не використовується для
# літнього часу, другий – ім’я локального часового поясу для літнього час у. Якщо часовий пояс літнього часу не
# визначено, другий рядок не слід використовувати. Дивіться примітку нижче.
print(time.tzname)  # ('Центральноєвроп. час (зима)', 'Центральноєвроп. час (літо)')
print(time.tzname[0])  # Центральноєвроп. час (зима)
if time.daylight != 0:
    print(time.tzname[1])  # Центральноєвроп. час (зима)
                           # Центральноєвроп. час (літо)

print(time.localtime().tm_zone)  # Центральноєвроп. час (зима)
print(time.localtime().tm_gmtoff)  # 3600
